/******************************************************************************
* File Name : gmouse.h                             Ver : 1.00  Date : 98-10-22
*
* Description :
*
*       ゲームシステム用 マウス入力 ヘッダファイル．
*
* Author : Moriharu Ohzu.
*
******************************************************************************/
#ifndef		_GMOUSE_H_
#define		_GMOUSE_H_

#include	"type.h"

/****** データ型宣言 *********************************************************/

typedef	void*		GMOUSE;			/* マウスハンドラ           */

/*----- マウスボタン入力情報 ------------------------------------------------*/

typedef	enum
{
	GMOUSE_BUTTON_1 = 0x0001U,		/* マウスボタン１           */
	GMOUSE_BUTTON_2 = 0x0002U,		/* マウスボタン２           */
	GMOUSE_BUTTON_3 = 0x0004U,		/* マウスボタン３           */
	GMOUSE_BUTTON_4 = 0x0008U		/* マウスボタン４           */

} GMOUSTATE;

/****** 関数プロトタイプ宣言 *************************************************/

#ifdef __cplusplus
extern "C" {
#endif

/*=============================================================================
*
* Purpose : マウスの生成．
*
* Return  : マウスハンドラを返す．
*
*============================================================================*/
GMOUSE
GMouseNew
(
	HINSTANCE		hinst,			/* インスタンスハンドラ     */
	HWND			hwnd			/* ウィンドウハンドラ       */
);

/*=============================================================================
*
* Purpose : マウスの消滅．
*
* Return  : なし．
*
*============================================================================*/
void
GMouseDelete
(
	GMOUSE			hnd				/* マウスハンドラ           */
);

/*=============================================================================
*
* Purpose : マウスの読み込み．
*
* Return  : なし．
*
*============================================================================*/
void
GMouseReadDevice
(
	GMOUSE			hnd				/* マウスハンドラ           */
);

/*=============================================================================
*
* Purpose : マウスの移動量を取得．
*
* Return  : なし．
*
*============================================================================*/
void
GMouseGetVelocity
(
	GMOUSE			hnd,			/* マウスハンドラ           */
	int*			x,				/*-> ｘ方向移動量           */
	int*			y,				/*-> ｙ方向移動量           */
	int*			z				/*-> ｚ方向移動量           */
);

/*=============================================================================
*
* Purpose : マウスカーソルの位置を取得．
*
* Return  : なし．
*
*============================================================================*/
void
GMouseGetCursorPosition
(
	GMOUSE			hnd,			/* マウスハンドラ           */
	int*			x,				/*-> ｘ座標                 */
	int*			y				/*-> ｙ座標                 */
);

/*=============================================================================
*
* Purpose : マウスのボタンの押下状態を取得．
*
* Return  : 押されていれば真，押されていければ偽を返す．
*
*============================================================================*/
BOOL
GMouseGetButtonState
(
	GMOUSE			hnd,			/* マウスハンドラ           */
	GMOUSTATE		state			/* 調べたいマウスのボタン   */
);

/*=============================================================================
*
* Purpose : マウスのボタンが押されたか調べる．
*
* Return  : 押されたら真，押されなければ偽を返す．
*
*============================================================================*/
BOOL
GMouseGetButtonTrigger
(
	GMOUSE			hnd,			/* マウスハンドラ           */
	GMOUSTATE		state			/* 調べたいマウスのボタン   */
);

/*=============================================================================
*
* Purpose : マウスのボタンが離されたか調べる．
*
* Return  : 離されたら真，離されなければ偽を返す．
*
*============================================================================*/
BOOL
GMouseGetButtonDetach
(
	GMOUSE			hnd,			/* マウスハンドラ           */
	GMOUSTATE		state			/* 調べたいマウスのボタン   */
);

/*=============================================================================
*
* Purpose : マウスカーソルの位置を設定．
*
* Return  : なし．
*
*============================================================================*/
void
GMouseSetCursorPosition
(
	GMOUSE			hnd,			/* マウスハンドラ           */
	int				x,				/* ｘ座標                   */
	int				y				/* ｙ座標                   */
);

/*=============================================================================
*
* Purpose : マウスのアクセス権の再取得．
*
* Return  : 取得できれば真，取得できなければ偽を返す．
*
*============================================================================*/
BOOL
GMouseReacquire
(
	GMOUSE				hnd			/* マウスハンドラ           */
);

#ifdef __cplusplus
}
#endif

#endif

/********** End of File ******************************************************/
