/******************************************************************************
* File Name : gwaveres.h                           Ver : 1.00  Date : 98-10-22
*
* Description :
*
*       ＷＡＶＥリソース管理 ヘッダファイル．
*
* Author : Moriharu Ohzu.
*
******************************************************************************/
#ifndef		_GWAVERES_H_
#define		_GWAVERES_H_

#include	"gsound.h"

/****** データ型宣言 *********************************************************/

typedef	void*	GWAVERESOURCE;		/* ＷＡＶＥリソースハンドラ */

/****** 関数プロトタイプ宣言 *************************************************/

#ifdef __cplusplus
extern "C" {
#endif

/*=============================================================================
*
* Purpose : ＷＡＶＥリソースの生成．
*
* Return  : なし．
*
*============================================================================*/
GWAVERESOURCE
GWaveResNew
(
	GSOUND			gsnd			/* サウンドハンドラ         */
);

/*=============================================================================
*
* Purpose : ＷＡＶＥリソースの消滅．
*
* Return  : なし．
*
*============================================================================*/
void
GWaveResDelete
(
	GWAVERESOURCE	hnd				/* ＷＡＶＥリソースハンドラ */
);

/*=============================================================================
*
* Purpose : ＷＡＶＥリソースの初期化．
*
* Return  : なし．
*
*============================================================================*/
void
GWaveResInit
(
	GWAVERESOURCE	hnd,			/* ＷＡＶＥリソースハンドラ */
	int				n				/* ＷＡＶＥリソース数       */
);

/*=============================================================================
*
* Purpose : ＷＡＶＥリソースをすべて解放．
*
* Return  : なし．
*
*============================================================================*/
void
GWaveResDelAllResource
(
	GWAVERESOURCE	hnd				/* ＷＡＶＥリソースハンドラ */
);

/*=============================================================================
*
* Purpose : ＷＡＶＥリソースの読み込み．
*
* Return  : 読み込みに成功したら真，失敗したら偽を返す．
*
*============================================================================*/
BOOL
GWaveResLoadResource
(
	GWAVERESOURCE	hnd,			/* ＷＡＶＥリソースハンドラ */
	int				id,				/* ＷＡＶＥリソースＩＤ     */
	const char*		wave_fname,		/* ＷＡＶＥファイル名       */
	int				cnt,			/* 同時再生数               */
	GWAVEFLAG		flag			/* 再生タイプフラグ         */
);

/*=============================================================================
*
* Purpose : ＷＡＶＥリソースの取得．
*
* Return  : 読み込みに成功したら真，失敗したら偽を返す．
*
*============================================================================*/
GWAVE
GWaveResGetResource
(
	GWAVERESOURCE	hnd,			/* ＷＡＶＥリソースハンドラ */
	int				id				/* ＷＡＶＥリソースＩＤ     */
);

/*=============================================================================
*
* Purpose : ＷＡＶＥリソースの解放．
*
* Return  : なし．
*
*============================================================================*/
void
GWaveResDelResource
(
	GWAVERESOURCE	hnd,			/* ＷＡＶＥリソースハンドラ */
	int				id				/* ＷＡＶＥリソースＩＤ     */
);

#ifdef __cplusplus
}
#endif

#endif

/********** End of File ******************************************************/
