/******************************************************************************
* File Name : gwave.h                              Ver : 1.00  Date : 98-10-22
*
* Description :
*
*       ゲームシステム用 ウェーブデータ管理 ヘッダファイル．
*
* Author : Moriharu Ohzu.
*
******************************************************************************/
#ifndef		_GWAVE_H_
#define		_GWAVE_H_

#include	"type.h"
#include	<dsound.h>

/****** 定数宣言 *************************************************************/

#define	GWAVE_DEFAULT	0x0000UL	/* 再生時ウェイト・ループなし     */
#define	GWAVE_WAIT		0x0001UL	/* 再生時ウェイト                 */
#define	GWAVE_LOOP		0x0002UL	/* 再生時ループ                   */

/****** データ型宣言 *********************************************************/

typedef	void*		GWAVE;			/* ウェーブデータハンドラ         */
typedef	DWORD		GWAVEFLAG;		/* ウェーブデータ再生タイプフラグ */

/****** 関数プロトタイプ宣言 *************************************************/

#ifdef __cplusplus
extern "C" {
#endif

/*=============================================================================
*
* Purpose : ウェーブデータの生成．
*
* Return  : ウェーブデータハンドラを返す．
*
*============================================================================*/
GWAVE
GWaveNew
(
	LPDIRECTSOUND		lpDS,		/* DirectSoundハンドラ              */
	const char*			fname,		/* WAVEファイル名                   */
	int					cnt,		/* 同時再生数                       */
	GWAVEFLAG			flag		/* 再生タイプ指定フラグ             */
);

/*=============================================================================
*
* Purpose : ウェーブデータの消滅．
*
* Return  : なし．
*
*============================================================================*/
void
GWaveDelete
(
	GWAVE				hnd			/* ウェーブデータハンドラ           */
);

/*=============================================================================
*
* Purpose : ウェーブデータの再生初期化．
*
* Return  : 初期化に成功すれば真，失敗したら偽を返す．
*
*============================================================================*/
void
GWavePlayInit
(
	GWAVE				hnd			/* ウェーブデータハンドラ           */
);

/*=============================================================================
*
* Purpose : ウェーブデータの再生．
*
* Return  : なし．
*
*============================================================================*/
void
GWavePlay
(
	GWAVE				hnd			/* ウェーブデータハンドラ           */
);

/*=============================================================================
*
* Purpose : ウェーブデータが再生中か調べる．
*
* Return  : 再生中であれば真，再生中でなければ偽を返す．
*
*============================================================================*/
BOOL
GWaveIsPlay
(
	GWAVE				hnd			/* ウェーブデータハンドラ           */
);

/*=============================================================================
*
* Purpose : ウェーブデータの停止．
*
* Return  : なし．
*
*============================================================================*/
void
GWaveStop
(
	GWAVE				hnd			/* ウェーブデータハンドラ           */
);

/*=============================================================================
*
* Purpose : ウェーブデータのボリューム設定．
*
* Return  : なし．
*
*============================================================================*/
void
GWaveSetVolume
(
	GWAVE				hnd,		/* ウェーブデータハンドラ           */
	int					volume		/* 左右のチャンネルの相対ボリューム */
);

/*=============================================================================
*
* Purpose : ウェーブデータのボリューム取得．
*
* Return  : ウェーブデータのボリューム取得を返す．
*
*============================================================================*/
int
GWaveGetVolume
(
	GWAVE				hnd			/* ウェーブデータハンドラ           */
);

/*=============================================================================
*
* Purpose : ウェーブデータの左右のチャンネルの相対ボリュームを設定する．
*
* Return  : なし．
*
*============================================================================*/
void
GWaveSetPan
(
	GWAVE				hnd,		/* ウェーブデータハンドラ           */
	int					pan			/* 左右のチャンネルの相対ボリューム */
);

/*=============================================================================
*
* Purpose : ウェーブデータの左右のチャンネルの相対ボリュームを取得する．
*
* Return  : 左右のチャンネルの相対ボリュームを返す．
*
*============================================================================*/
int
GWaveGetPan
(
	GWAVE				hnd			/* ウェーブデータハンドラ           */
);

#ifdef __cplusplus
}
#endif

#endif

/********** End of File ******************************************************/
