/******************************************************************************
* File Name : heap.h                               Ver : 1.00  Date : 97-10-22
*
* Description :
*
*		ヒープメモリ管理 ヘッダファイル．
*
* Author : Moriharu Ohzu.
*
******************************************************************************/
#ifndef		_HEAP_H_
#define		_HEAP_H_

#include	<stdlib.h>

#ifdef __cplusplus
extern "C" {
#endif

/*=============================================================================
*
* Purpose : ヒープメモリの確保．
*
* Return  : 確保したヒープメモリの先頭アドレスを返す．
*
*============================================================================*/
void*
new_object
(
	size_t			size			/* 確保するメモリのバイト数 */
);

/*=============================================================================
*
* Purpose : ヒープメモリの解放．
*
* Return  : なし．
*
*============================================================================*/
#define	del_object( p )		free( (p) )

#ifdef __cplusplus
}
#endif

#endif

/********** End of File ******************************************************/
