/******************************************************************************
* File Name : heap.c                               Ver : 1.00  Date : 97-10-22
*
* Description :
*
*       ヒープメモリ管理．
*
* Author : Moriharu Ohzu.
*
******************************************************************************/
#include	"heap.h"
#include	<stdio.h>

/*=============================================================================
*
* Purpose : ヒープメモリの確保．
*
* Return  : 確保したヒープメモリの先頭アドレスを返す．
*
*============================================================================*/
void*
new_object
(
	size_t			size			/* 確保するメモリのバイト数 */
)
{
	void*			heap;

	if ( ( heap = malloc( size ) ) == NULL )
	{
		fflush( stdout );
		fprintf( stderr, "メモリが足りませんでした．" );
		fflush( stderr );
		abort();
	}

	return	heap;
}

/********** End of File ******************************************************/
